core/plugins/PageBuilder/Addons/Tenants/ThemeOne/Blog/BlogOne.php

select * from `blog_categories` where (`status` = 1)
---
    public function admin_render()
    {
        $output = $this->admin_form_before();
        $output .= $this->admin_form_start();
        $output .= $this->default_fields();

        $widget_saved_values = $this->get_settings();

        $categories = BlogCategory::where(['status' => 1])->get()->mapWithKeys(function ($item){
            return [$item->id => $item->title];
        })->toArray();

select * from `blogs` where `status` = 1 and `category_id` in ('4', '5', '6', '8', '9') order by `id` desc limit 10
---
    public function frontend_render()
    {
        $category = $this->setting_item('categories');
        $order_by = SanitizeInput::esc_html($this->setting_item('order_by')) ?? 'id';
        $order = SanitizeInput::esc_html($this->setting_item('order')) ?? 'asc';
        $items = SanitizeInput::esc_html($this->setting_item('items'));
        $title = SanitizeInput::esc_html($this->setting_item('title'));
        $padding_top = SanitizeInput::esc_html($this->setting_item('padding_top'));
        $padding_bottom = SanitizeInput::esc_html($this->setting_item('padding_bottom'));

        $blogs = Blog::where('status', 1);

        if(!empty($category)) {
            $blogs->whereIn('category_id',$category);
        }

        if (!empty($items)) {
            $blogs =  $blogs->orderBy($order_by,$order)->take($items)->get();