core/plugins/WidgetBuilder/Widgets/BlogCategoryWidget.php

select * from `blog_categories` where `status` = 1 order by `id` desc
---
    public function frontend_render()
    {
        $settings = $this->get_settings();
        $widget_title = SanitizeInput::esc_html($settings['widget_title'] ?? '');
        $category_items = $settings['category_items'] ?? '';
        $blog_categories = BlogCategory::where('status',1)->orderBy('id', 'DESC')->take($category_items)->get();