core/plugins/WidgetBuilder/Widgets/RecentBlogPostWidget.php

    public function frontend_render()
    {
        $settings = $this->get_settings();
        $widget_title = SanitizeInput::esc_html($settings['heading_text'] ?? '');
        $blog_items = $settings['blog_items'] ?? '';

        $blog_posts = Blog::where(['status' => 1])->take($blog_items)->orderBy('views','desc')->get();
---
select * from `blogs` where (`status` = 1) order by `views` desc