core/plugins/WidgetBuilder/Widgets/TenantServiceCategoryWidget.php

    public function admin_render()
    {
        $output = $this->admin_form_before();
        $output .= $this->admin_form_start();
        $output .= $this->default_fields();
        $widget_saved_values = $this->get_settings();

        //render language tab
        $output .= $this->admin_language_tab();
        $output .= $this->admin_language_tab_start();

        $all_languages = Language::all();
---
select * from `languages`

    public function frontend_render()
    {
        $settings = $this->get_settings();
        $user_selected_language = get_user_lang();
        $widget_title = SanitizeInput::esc_html($settings['widget_title_' . $user_selected_language] ?? '');
        $category_items = $settings['category_items'] ?? '';
        $blog_categories = ServiceCategory::where('status',1)->orderBy('id', 'DESC')->take($category_items)->get();
---
select * from `service_categories` where `status` = 1 order by `id` desc