core/Modules/RefundModule/Http/Controllers/RefundChatController.php

    public function chat_list(){
        $all_chats = RefundChat::where('user_id', \Auth::guard('web')->user()->id)->paginate(10);
---
select * from `refund_chat` where `user_id` = 1 limit 10 offset 0
select count(*) as aggregate from `refund_chat` where `user_id` = 1