core/Modules/ShippingModule/Http/Controllers/ShippingMethodController.php

select * from `shipping_methods`
---
    public function index()
    {
        $all_shipping_methods = ShippingMethod::with('zone')->get();

insert into `shipping_methods` (`name`, `zone_id`, `updated_at`, `created_at`) values ('Flat Rate', '1', '2023-01-10 13:00:15', '2023-01-10 13:00:15')
---
    public function store(Request $request)
    {
        $this->validate($request, [
            'zone_id' => 'required|exists:zones,id',
            'title' => 'required|string',
            'tax_status' => 'required|boolean',
            'status' => 'required|boolean',
            'setting_preset' => 'required|string',
            'cost' => 'required|numeric',
            'minimum_order_amount' => 'nullable|numeric',
            'coupon_code' => 'nullable'
        ]);

        $all_shipping_method_names = ShippingEnum::shippingMethods();

        try {
            DB::beginTransaction();

            $shipping_method_key = $request->title;
            $shipping_method_title = $all_shipping_method_names[$shipping_method_key];

            $shipping_method = ShippingMethod::create([
                'name' => SanitizeInput::esc_html($shipping_method_title),
                'zone_id' => $request->zone_id,
            ]);