core/Modules/ShippingModule/Http/Controllers/ZoneController.php

select * from `zones`
select * from `countries` where `status` = 'publish'
---
    public function index()
    {
        $all_zones = Zone::all();
        $all_countries = Country::where('status', 'publish')->get();