core/Modules/Badge/Http/Controllers/BadgeController.php

    public function destroy($id)
    {
        $deleted = Badge::findOrFail($id)->delete();
---
select * from `badges` where `badges`.`id` = '5' and `badges`.`deleted_at` is null limit 1
update `badges` set `deleted_at` = '2023-01-09 20:01:49', `badges`.`updated_at` = '2023-01-09 20:01:49' where `id` = 5