core/app/Helpers/Payment/PaymentGatewayCredential.php

select * from `payment_gateways` where `name` = 'paytm' limit 1
---
    public static function get_paytm_credential() : object
    {
        $paypal_credential_from_database = PaymentGateway::where('name', 'paytm')->first();