core/Modules/CouponManage/Http/Controllers/AdminCouponController.php

    public function index()
    {
        $all_product_coupon = ProductCoupon::all();
        $coupon_apply_options = CouponEnum::discountOptions();
        $all_categories = Category::where("status_id", "1")->get();
        $all_subcategories = SubCategory::where("status_id", "1")->get();
        $all_childcategories = ChildCategory::where("status_id", "1")->get();
---
select * from `product_coupons`
select * from `categories` where `status_id` = '1' and `categories`.`deleted_at` is null
select * from `sub_categories` where `status_id` = '1' and `sub_categories`.`deleted_at` is null
select * from `child_categories` where `status_id` = '1' and `child_categories`.`deleted_at` is null