core/Modules/Product/Http/Traits/ProductGlobalTrait.php

                "sold_count" => 0
            ];

            $productDetailId = ProductInventoryDetail::create($arr);
---
insert into `product_inventory_details` (`product_id`, `product_inventory_id`, `color`, `size`, `hash`, `additional_price`, `add_cost`, `image`, `stock_count`, `sold_count`) values (237, 258, '13', '6', '', '200', '200', '517', '200', 0)

    public function createdByUpdatedBy($product_id, $type= "create"){
        return ProductCreatedBy::updateOrCreate(
            [
                "product_id" => $product_id
            ],
            $this->createArrayCreatedBy($product_id, $type)
        );
---
select * from `product_created_by` where (`product_id` = 199) limit 1
insert into `product_created_by` (`product_id`, `created_by_id`, `guard_name`) values (199, 1, 'admin')

    public function insert_product_data(array $data, $id, $product): bool
    {
        $inventory = ProductInventory::create($this->prepareInventoryData($data, $id));
        $inventoryDetail = false;

        if (!empty($product["item_stock_count"][0])) {
            $inventoryDetail = $this->prepareProductInventoryDetailsAndInsert($data, $id, $inventory->id);
        }

        $category = ProductCategory::create($this->productCategoryData($product, $id));
        $subcategory = ProductSubCategory::create($this->productCategoryData($product, $id, "sub_category_id", "sub_category"));
        $childCategory = ProductChildCategory::insert($this->childCategoryData($product, $id));
        $deliveryOptions = ProductDeliveryOption::insert($this->prepareDeliveryOptionData($product, $id));
        $productGallery = ProductGallery::insert($this->prepareProductGalleryData($product, $id));
        $productTag = ProductTag::insert($this->prepareProductTagData($product, $id));
        $productUom = ProductUom::create($this->prepareUomData($data, $id));

        $productPolicy = ProductShippingReturnPolicy::create([
            'product_id' => $id,
            'shipping_return_description' => purify_html(str_replace(["<script>","</script>", 'script'],"",$data['policy_description']))
        ]);
---
insert into `product_inventories` (`sku`, `stock_count`, `product_id`) values ('microwaveaasd-1', 10, 199)
insert into `product_categories` (`category_id`, `product_id`) values (13, 199)
insert into `product_sub_categories` (`sub_category_id`, `product_id`) values (19, 199)
insert into `product_child_categories` (`child_category_id`, `product_id`) values (21, 199)
insert into `product_delivery_options` (`delivery_option_id`, `product_id`) values ('4', 199)
insert into `product_tags` (`product_id`, `tag_name`) values (199, 'alert(\'XXS!\')')
insert into `product_uom` (`product_id`, `unit_id`, `quantity`) values (199, 7, 14)
insert into `product_shipping_return_policies` (`product_id`, `shipping_return_description`, `updated_at`, `created_at`) values (199, '&lt;&gt;alert(\'XXS!\')&gt;', '2023-01-10 13:18:03', '2023-01-10 13:18:03')

    private function get_product($type = "single", $id): Model|Builder|null
    {
        // get product instance
        $product = $this->productInstance($type);
        return $product->with("brand")->where("id",$id)->first();
---
select * from `brands` where `brands`.`id` in (9) and `brands`.`deleted_at` is null

    public function productStore($data){
        $product_data = self::ProductData($data);
        $slug = $data['slug'] ?? $data['name'];
        $product_data['slug'] = create_slug(Str::slug($slug), 'Product', true, 'Product', 'slug');
        $product = Product::create($product_data);
        $id = $product->id;
        $product->metaData()->updateOrCreate(["metainfoable_id" => $id],$this->prepareMetaData($data));
---
insert into `products` (`name`, `slug`, `summary`, `description`, `image_id`, `price`, `sale_price`, `cost`, `badge_id`, `brand_id`, `min_purchase`, `max_purchase`, `is_inventory_warn_able`, `is_refundable`, `updated_at`, `created_at`) values ('alert(\'XXS!\')', 'scriptalertxxsscript-5', 'alert(\'XXS!\')', '<pre class=\"c-mrkdwn__pre\" data-stringify-type=\"pre\" style=\"box-sizing: inherit; margin-top: 4px; margin-bottom: 4px; padding: 8px; --saf-0:rgba(var(--sk_foreground_low,29,28,29),0.13); overflow-wrap: break-word; font-size: 12px; font-variant-ligatures: none; line-height: 1.50001; tab-size: 4; white-space: pre-wrap; word-break: normal; background: rgba(var(--sk_foreground_min,29,28,29),0.04); border: 1px solid var(--saf-0); border-radius: 4px; counter-reset: list-0 0 list-1 0 list-2 0 list-3 0 list-4 0 list-5 0 list-6 0 list-7 0 list-8 0 list-9 0; color: rgb(209, 210, 211); font-family: Monaco, Menlo, Consolas, &quot;Courier New&quot;, monospace !important;\">&lt;&gt;alert(\'XXS!\')&lt;/&gt;</pre>', '508', '120', '225', '700', '5', '9', '1', '10', 2, 0, '2023-01-09 17:59:47', '2023-01-09 17:59:47')
insert into `meta_infos` (`metainfoable_id`, `metainfoable_type`, `title`, `description`, `fb_title`, `fb_description`, `fb_image`, `tw_title`, `tw_description`, `tw_image`, `updated_at`, `created_at`) values (237, 'Modules\Product\Entities\Product', 'alert(\'XXS!\')', 'alert(\'XXS!\')', '', '', '', '', '', '', '2023-01-09 17:59:47', '2023-01-09 17:59:47')

    public function productClone($id): bool
    {
        $data = array();
        $product = Product::findOrFail($id);
        $product_data = self::CloneData($product);

        $newProduct = $product->create($product_data);
        $id = $newProduct->id;

        $metaData = [];
        if ($product?->metaData != null)
        {
            $metaData = [
                'general_title' => $product?->metaData?->title,
                'general_description' => $product?->metaData?->description,
                'facebook_title' => $product?->metaData?->fb_title,
                'facebook_description' => $product?->metaData?->fb_description,
                'facebook_image' => $product?->metaData?->fb_image,
                'twitter_title' => $product?->metaData?->tw_title,
                'twitter_description' => $product?->metaData?->tw_description,
                'twitter_image' => $product?->metaData?->tw_image,
            ];
        }

        $newProduct->metaData()->create(["metainfoable_id" => $id],$this->prepareMetaData($metaData));
---
insert into `products` (`name`, `slug`, `summary`, `description`, `image_id`, `price`, `sale_price`, `cost`, `badge_id`, `brand_id`, `status_id`, `min_purchase`, `max_purchase`, `is_inventory_warn_able`, `is_refundable`, `updated_at`, `created_at`) values ('alert(\'XXS!\')', 'scriptalertxxsscript-1', 'alert(\'XXS!\')', '<>alert(\'XXS!\')</>', '437', 10, 10, 10, 4, 9, 2, 10, 15, 1, 0, '2023-01-10 13:18:03', '2023-01-10 13:18:03')
insert into `meta_infos` (`metainfoable_id`, `metainfoable_type`, `updated_at`, `created_at`) values (199, 'Modules\Product\Entities\Product', '2023-01-10 13:18:03', '2023-01-10 13:18:03')


        $product->category_id = optional($product->category)->id;
        $product->sub_category = optional($product->subCategory)->id;
        $product->child_category = current(optional($product->childCategory)->pluck('id'));
---
select `child_categories`.*, `product_child_categories`.`product_id` as `laravel_through_key` from `child_categories` inner join `product_child_categories` on `product_child_categories`.`child_category_id` = `child_categories`.`id` where `product_child_categories`.`product_id` = 198 and `child_categories`.`deleted_at` is null

    protected function bulk_delete($ids)
    {
        $product = Product::whereIn('id' ,$ids)->delete();
---
update `products` set `deleted_at` = '2023-01-09 18:01:22', `products`.`updated_at` = '2023-01-09 18:01:22' where `id` in ('239', '238', '237', '236', '235', '234', '233', '232') and `products`.`deleted_at` is null