core/Modules/Attributes/Http/Controllers/BrandController.php

select * from `brands` where `brands`.`deleted_at` is null
---
    public function index(): Renderable
    {
        $delivery_manages = Brand::all();