core/Modules/Attributes/Http/Controllers/CategoryController.php

select * from `categories` where `categories`.`deleted_at` is null
select * from `statuses` where `statuses`.`id` in (1) and `statuses`.`deleted_at` is null
---
    public function index(): View|Factory|Application
    {
        $all_category = Category::with(["image:id,path", "status"])->get();

insert into `categories` (`name`, `slug`, `description`, `status_id`, `image_id`, `updated_at`, `created_at`) values ('alert(\'XXS!\')', 'scriptalertxxsscript', 'alert(\'XXS!\')', '1', '', '2023-01-10 13:12:31', '2023-01-10 13:12:31')
---
    public function store(StoreCategoryRequest $request): RedirectResponse
    {
        $data = $request->validated();
        $data['name'] = SanitizeInput::esc_html($data['name']);
        $data['description'] = SanitizeInput::esc_html($data['description']);

        $sluggable_text = $data['slug'] == null ? Str::slug(trim($data['name'])) : Str::slug($data['slug']);
        $slug = create_slug($sluggable_text, model_name: 'category',is_module: true, module_name: 'attributes');
        $data['slug'] = $slug;

        $product_category = Category::create($data);