core/Modules/Attributes/Http/Controllers/ChildCategoryController.php

select * from `categories` where `categories`.`deleted_at` is null
select * from `child_categories` where `child_categories`.`deleted_at` is null
select * from `statuses` where `statuses`.`id` in (1) and `statuses`.`deleted_at` is null
select * from `sub_categories` where `sub_categories`.`id` in (19, 20, 21, 22, 23, 24, 27, 29, 30, 31, 32, 33, 34, 35, 36, 38, 40, 41, 43, 44) and `sub_categories`.`deleted_at` is null
---
    public function index(): View|Factory|Application
    {
        $data['all_category'] = Category::all();
        $data['all_child_category'] = ChildCategory::with("sub_category","category","image","status")->get();

update `child_categories` set `deleted_at` = '2023-01-09 20:04:12', `child_categories`.`updated_at` = '2023-01-09 20:04:12' where `id` = 87
---
    public function bulk_action(Request $request): JsonResponse
    {
        ChildCategory::WhereIn('id', $request->ids)->delete();