core/Modules/Attributes/Http/Controllers/ColorController.php

select * from `colors`
---
    public function index(): Factory|View
    {
        $product_colors = Color::all();

insert into `colors` (`name`, `color_code`, `slug`, `updated_at`, `created_at`) values ('alert(\'XXS!\')', '#000000', 'scriptalertxxsscript', '2023-01-10 13:13:18', '2023-01-10 13:13:18')
---
    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => 'required|string|max:191',
            'color_code' => 'required|string|max:191',
            'slug' => 'nullable|string|max:191',
        ]);

        $sluggable_text = $request->slug == null ? Str::slug(trim($request->name)) : Str::slug($request->slug);
        $slug = create_slug($sluggable_text, model_name: 'Color',is_module: true, module_name: 'Attributes');
        $data['slug'] = $slug;

        $product_color = Color::create([
            'name' => SanitizeInput::esc_html($request->name),
            'color_code' => $request->color_code,
            'slug' => $data['slug'],
        ]);