core/Modules/Attributes/Http/Controllers/DeliveryOptionController.php

select * from `delivery_options` where `delivery_options`.`deleted_at` is null
---
    public function index(): Renderable
    {
        $delivery_manages = DeliveryOption::all();