core/Modules/Attributes/Http/Controllers/SizeController.php

    public function index()
    {
        $product_sizes = Size::all();
---
select * from `sizes`