core/Modules/Attributes/Http/Controllers/SubCategoryController.php

    public function index(): View|Factory|Application
    {
        $data = [];
        $data['all_category'] = Category::with(["image:id,path","status"])->get();
        $data['all_sub_category'] = SubCategory::with(["image:id,path","status","category:id,name"])->get();
---
select * from `categories` where `categories`.`deleted_at` is null
select * from `statuses` where `statuses`.`id` in (1) and `statuses`.`deleted_at` is null
select `id`, `name` from `categories` where `categories`.`id` in (6, 7, 8, 9, 10, 11) and `categories`.`deleted_at` is null