core/app/Http/Controllers/Landlord/Admin/CustomFormBuilderController.php

    public function all(){
        $all_forms = FormBuilder::all();
---
select * from `form_builders`