core/app/Http/Controllers/Landlord/Admin/MediaUploaderController.php

select * from `media_uploaders` order by `id` desc limit 20
select * from `media_uploaders` where `media_uploaders`.`id` is null limit 1
---
    public function all_upload_media_file(Request $request)
    {
        $image_query = MediaUploader::query();
        if ($request->user_type === 'user'){
            $image_query->where(['user_type' => 1,'user_id' => \Auth::guard('web')->id()]);
        }
        $all_images = $image_query->orderBy('id', 'DESC')->take(20)->get();
        $selected_image = MediaUploader::find($request->selected);

select * from `media_uploaders` order by `id` desc limit 20 offset 19
---
    public function get_image_for_load_more(Request $request){
        $image_query = MediaUploader::query();
        if ($request->user_type === 'user'){
            $image_query->where(['user_type' => 1,'user_id' => \Auth::guard('web')->id()]);
        }
        $all_images = $image_query->orderBy('id', 'DESC')->skip($request->skip)->take(20)->get();