core/app/Http/Controllers/Landlord/Admin/OrderManageController.php

select * from `payment_logs` where `payment_logs`.`id` = '128' limit 1
update `payment_logs` set `status` = 'complete', `payment_logs`.`updated_at` = '2023-01-09 19:53:49' where `id` = 128
---
    public function change_status(Request $request){
        $this->validate($request,[
            'order_status' => 'required|string|max:191',
            'order_id' => 'required|string|max:191'
        ]);

        $order_details = PaymentLogs::find($request->order_id);
        $order_details->status = $request->order_status;
        $order_details->save();

select * from `payment_logs` where `payment_logs`.`id` = '122' limit 1
select * from `users` where `users`.`id` = 10 limit 1
---
    public function order_delete(Request $request,$id)
    {
        $log = PaymentLogs::findOrFail($id);
        $user = \App\Models\User::findOrFail($log->user_id);