core/app/Http/Controllers/Landlord/Admin/PagesController.php

    public function all_pages()
    {
        $all_pages = Page::orderBy('id','asc')->get();
---
select * from `pages` order by `id` asc

    public function page_builder($id)
    {
        $page = Page::with('metainfo')->findOrfail($id);
---
select * from `pages` where `pages`.`id` = '1' limit 1