core/app/Http/Controllers/Landlord/Admin/PricePlanController.php

    public function all_price_plan(){
        $all_plans = PricePlan::orderBy('id','desc')->get();
---
select * from `price_plans` order by `id` desc

    public function update(Request $request){
        $type_validation  = tenant() ? 'nullable' : 'required';
        $this->validate($request,[
            'id' => 'required|integer',
            'title' => 'required|string',
            'package_badge' => 'required|string',
            'features' => 'required',
            'type' => ''.$type_validation.'|integer',
            'price' => 'required|numeric',
            'status' => 'required|integer',
            'page_permission_feature'=> 'nullable|integer|min:-1',
            'blog_permission_feature'=> 'nullable|integer|min:-1',
            'product_permission_feature'=> 'nullable|integer|min:-1',
            'storage_permission_feature'=> 'required|integer|min:-1',
        ]);
        //create data for price plan
        $price_plan =  PricePlan::find($request->id);
---
select * from `price_plans` where `price_plans`.`id` = '2' limit 1

        $price_plan->save();

        if(!tenant()) {
            $price_plan->plan_features()->delete();
            $features = $request->features;
            foreach ($features as $feat) {
                PlanFeature::where('plan_id',$price_plan->id)->create([
                    'plan_id' => $price_plan->id,
                    'feature_name' => $feat,
                ]);
---
delete from `plan_features` where `plan_features`.`plan_id` = 2 and `plan_features`.`plan_id` is not null
insert into `plan_features` (`plan_id`, `feature_name`, `updated_at`, `created_at`) values (2, 'products', '2023-01-09 17:54:56', '2023-01-09 17:54:56')