core/app/Http/Controllers/Landlord/Admin/TenantManageController.php

    public function all_tenants(){
        $all_users = User::latest()->paginate(10);
---
select * from `users` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `users`

    public function tenant_details($id)
    {
        $user = User::with('tenant_details','tenant_details.payment_log')->findOrFail($id);
---
select * from `payment_logs` where `payment_logs`.`tenant_id` in ('furniture', 'hexfashion', 'siaam', 'test') order by `created_at` desc
select * from `users` where `users`.`id` = '10' limit 1

    public function assign_subscription(Request $request)
    {
       $request->validate([
           'package' => 'required',
           'payment_status' => 'required',
       ]);

       if ($request->custom_subdomain == null)
       {
           $request->validate([
               'subdomain' => 'required'
           ]);
       }

        $subdomain = $request->custom_subdomain != null ? $request->custom_subdomain : $request->subdomain;

        $user = User::findOrFail($request->subs_user_id);
        $package = PricePlan::findOrFail($request->subs_pack_id);
---
select * from `users` where `users`.`id` = '10' limit 1
select * from `price_plans` where `price_plans`.`id` = '4' limit 1

            }
        }

        $tenant = Tenant::find($subdomain);
---
select * from `tenants` where `tenants`.`id` = 'new' limit 1

            }
        } else {
            event(new TenantRegisterEvent($user, $subdomain, get_static_option('default_theme')));
            $tenant = DB::table('tenants')->where('user_id', $user->id)->latest()->select('id')->first();

            $payment_log_id = PaymentLogs::create([
                'email' => $user->email,
                'name' => $user->name,
                'package_name' => $package->title,
                'package_price' => $package->price,
                'package_gateway' => null,
                'package_id' => $package->id,
                'user_id' => $user->id,
                'tenant_id' => $tenant->id,
                'status' => 'pending',
                'is_renew' => 0,
                'payment_status' => $request->payment_status,
                'track' => Str::random(10) . Str::random(10),
                'created_at' => Carbon::now(),
                'updated_at' => Carbon::now(),
                'start_date' => $package_start_date,
                'expire_date' => $package_expire_date,
            ]);

            DB::table('tenants')->where('id', $payment_log_id->tenant_id)->update([
                'start_date' => $package_start_date,
                'expire_date' => $package_expire_date,
            ]);
            $payment_details = PaymentLogs::findOrFail($payment_log_id->id);
---
select `id` from `tenants` where `user_id` = 10 order by `created_at` desc limit 1
insert into `payment_logs` (`email`, `name`, `package_name`, `package_price`, `package_gateway`, `package_id`, `user_id`, `tenant_id`, `status`, `is_renew`, `payment_status`, `track`, `start_date`, `expire_date`, `updated_at`, `created_at`) values ('misujon01@gmail.com', 'Mazharul Islam Suzon', 'Ultimate Plan', 599, '', 4, 10, 'new', 'pending', 0, 'complete', 'PN72qcunOaZSp8qnZ1c7', '10-01-2023 12:54:11', '2023-02-10 12:54:11', '2023-01-10 12:54:49', '2023-01-10 12:54:49')
update `tenants` set `start_date` = '10-01-2023 12:54:11', `expire_date` = '10-02-2023 12:54:11' where `id` = 'new'
select * from `payment_logs` where `payment_logs`.`id` = 131 limit 1