core/app/Http/Controllers/Landlord/Admin/WidgetsController.php

    public function update_widget(Request $request){
        $this->validate($request,[
            'widget_name' => 'required',
            'widget_order' => 'required',
            'widget_location' => 'required',
            'namespace' => 'required'
        ]);

        unset($request['_token']);
        $widget_content = (array) $request->all();

        Widgets::findOrFail($request->id)->update([
            'widget_name' => $request->widget_name,
            'widget_order' => $request->widget_order,
            'widget_location' => $request->widget_location,
            'widget_content' => serialize($widget_content),
            'widget_namespace' => $request->namespace,
        ]);
---
select * from `widgets` where `widgets`.`id` = '35' limit 1

    public function delete_widget(Request $request){
        Widgets::findOrFail($request->id)->delete();
---
delete from `widgets` where `id` = 24
select * from `widgets` where `widgets`.`id` = '24' limit 1

    public function update_order_widget(Request $request){
        Widgets::findOrFail($request->id)->update(['widget_order' => $request->widget_order]);
---
select * from `widgets` where `widgets`.`id` = '36' limit 1
update `widgets` set `widget_order` = '25', `widgets`.`updated_at` = '2023-01-10 11:35:38' where `id` = 36