core/plugins/PageBuilder/Addons/Tenants/Service/ServiceOne.php

    public function frontend_render()
    {
        $item = $this->setting_item('item') ?? '';
        $padding_top = SanitizeInput::esc_html($this->setting_item('padding_top'));
        $padding_bottom = SanitizeInput::esc_html($this->setting_item('padding_bottom'));
        $order_by = SanitizeInput::esc_html($this->setting_item('order_by'));
        $order = SanitizeInput::esc_html($this->setting_item('order'));

        $service = Service::query();
        $service = $service->where('status',1)->orderBy($order_by ?? 'id',$order ?? 'asc');
        if(!empty($item)) {

            if($item < 2){
                $service = $service->take(2)->get();
            }else{
                $service = $service->take($item)->get();
---
select * from `services` where `status` = 1 order by `created_at` desc limit 20