core/plugins/WidgetBuilder/WidgetBase.php

select * from `widgets` where `widgets`.`id` = 15 limit 1
---
    public function get_settings()
    {
        $widget_data = !empty($this->args['id']) ? Widgets::find($this->args['id']) : [];

select * from `languages`
---
    public function admin_language_tab(){
        $all_languages = Language::all();