core/plugins/WidgetBuilder/Widgets/Tenants/ThemeOne/FooterBottomLinksWidget.php

    public function admin_render()
    {
        $output = $this->admin_form_before();
        $output .= $this->admin_form_start();
        $output .= $this->default_fields();
        $widget_saved_values = $this->get_settings();

        $menus = Menu::select('id', 'title')->get()->mapWithKeys(function ($item) {
            return [$item['id'] => $item['title']];
        });
---
select `id`, `title` from `menus`

    public function frontend_render()
    {
        // TODO: Implement frontend_render() method.
        $widget_saved_values = $this->get_settings();
        $widget_navbar = SanitizeInput::esc_url($widget_saved_values['navbar_link']) ?? '';

        $instance = Menu::findOrFail($widget_navbar);
---
select * from `menus` where `menus`.`id` = '1' limit 1