core/app/Listeners/TenantDomainCreate.php

    public function handle(TenantRegisterEvent $event)
    {
        try{
            $tenant = Tenant::create(['id' => $event->subdomain]);
            DB::table('tenants')->where('id',$tenant->id)->update(['user_id' => optional($event->user_info)->id, 'theme_slug' => $event->theme]);
            $tenant->domains()->create(['domain' => $event->subdomain.'.'.getenv('CENTRAL_DOMAIN')]);
---
insert into `tenants` (`id`, `updated_at`, `created_at`) values ('new', '2023-01-10 12:54:11', '2023-01-10 12:54:11')
update `tenants` set `user_id` = 10, `theme_slug` = 'theme-1' where `id` = 'new'
insert into `domains` (`domain`, `tenant_id`, `updated_at`, `created_at`) values ('new.nazmart.net', 'new', '2023-01-10 12:54:43', '2023-01-10 12:54:43')