core/plugins/PageBuilder/Addons/Tenants/ThemeOne/Common/Brand.php

select `id`, `name` from `brands` where `brands`.`deleted_at` is null
---
    public function admin_render()
    {
        $output = $this->admin_form_before();
        $output .= $this->admin_form_start();
        $output .= $this->default_fields();
        $widget_saved_values = $this->get_settings();

        $brand = \Modules\Attributes\Entities\Brand::select('id','name')->get()->mapWithKeys(function ($item){
            return [$item->id => $item->name];
        })->toArray();

select * from `brands` where `id` in ('2', '3', '4', '5', '6', '7', '8') and `brands`.`deleted_at` is null limit 8
---
    public function frontend_render()
    {
        $brands_id = $this->setting_item('brand');
        $item_show = SanitizeInput::esc_html($this->setting_item('item_show') ?? '');
        $item_pagination = SanitizeInput::esc_html($this->setting_item('item_pagination') ?? '');
        $padding_top = SanitizeInput::esc_html($this->setting_item('padding_top'));
        $padding_bottom = SanitizeInput::esc_html($this->setting_item('padding_bottom'));

        $brands = [];
        if (!empty($brands_id)) {
            $brands = \Modules\Attributes\Entities\Brand::whereIn('id', $brands_id);

            if (!empty($item_show)) {
                $brands = $brands->take($item_show)->get();