core/plugins/PageBuilder/Addons/Tenants/ThemeOne/Common/DealArea.php

select `title`, `id` from `campaigns` where `status` = 'publish'
---
    public function admin_render()
    {
        $output = $this->admin_form_before();
        $output .= $this->admin_form_start();
        $output .= $this->default_fields();

        $widget_saved_values = $this->get_settings();

        $output .= Text::get([
            'name' => 'title',
            'label' => __('Title'),
            'value' => $widget_saved_values['title'] ?? null,
        ]);
        $output .= Textarea::get([
            'name' => 'short_description',
            'label' => __('Short Description'),
            'value' => $widget_saved_values['short_description'] ?? null,
        ]);

        $campaigns = Campaign::where('status', 'publish')->pluck('title', 'id')->toArray();