core/plugins/PageBuilder/Addons/Tenants/ThemeOne/Common/Testimonial.php

select * from `testimonials` where `status` = 1 order by `id` asc limit 25
---
    public function frontend_render()
    {
        $title = SanitizeInput::esc_html($this->setting_item('title')) ?? '';
        $item = $this->setting_item('item') ?? '';
        $padding_top = SanitizeInput::esc_html($this->setting_item('padding_top'));
        $padding_bottom = SanitizeInput::esc_html($this->setting_item('padding_bottom'));

        $order_by = SanitizeInput::esc_html($this->setting_item('order_by'));
        $order = SanitizeInput::esc_html($this->setting_item('order'));


        $testimonial = \App\Models\Testimonial::query();
        if(!empty($item)){
             $testimonial = $testimonial->where('status',1)->orderBy($order_by ?? 'id',$order ?? 'asc')->take($item)->get();