core/plugins/PageBuilder/Addons/Tenants/ThemeTwo/Common/CategoriesSlider.php

    public function frontend_render()
    {
        $product_count = $this->setting_item('product_count');
        $categories = $this->setting_item('categories') ?? '';

        $categories_info = Category::whereIn('id', !empty($categories) ? $categories : [])->select('id', 'name', 'slug', 'image_id')->get();
---
select `id`, `name`, `slug`, `image_id` from `categories` where `id` in ('13', '14', '16', '17', '18', '19', '20') and `categories`.`deleted_at` is null