core/Modules/Blog/Http/Controllers/Landlord/Admin/BlogTagController.php

    public function index(){
        $all_tag = BlogTag::select(['id','title', 'slug'])->get();
---
select `id`, `title`, `slug` from `blog_tags`