core/Modules/Blog/Http/Controllers/Landlord/Admin/BlogController.php

select * from `blog_categories` where `status` = 1
---
    public function new_blog(Request $request){

        $all_category = BlogCategory::where('status',1)->get();