core/app/Http/Controllers/Tenant/Admin/AdminRoleManageController.php

    public function all_admin_role(){
        $roles = Role::all();
---
select * from `roles`