core/app/Http/Controllers/Tenant/Admin/MenuController.php

select * from `menus`
---
    public function index()
    {
        $all_menu = Menu::all();