core/app/Http/Controllers/Tenant/Admin/TenantDashboardController.php

    public function dashboard(){
        $total_admin = Admin::count();
        $total_user= User::count();
        $all_blogs = Blog::count();
        $total_products = Product::count();;
        $total_orders = ProductOrder::count();
        $total_sale = ProductOrder::where('payment_status', 'success')->sum('total_amount');
        $current_package = tenant()->payment_log;
        $recent_order_logs = ProductOrder::orderBy('id','desc')->select('id','name', 'email', 'total_amount', 'payment_gateway', 'payment_status', 'status','created_at')->take(10)->get();
---
select count(*) as aggregate from `admins`
select count(*) as aggregate from `users`
select count(*) as aggregate from `blogs`
select count(*) as aggregate from `products` where `products`.`deleted_at` is null
select count(*) as aggregate from `product_orders`
select sum(`total_amount`) as aggregate from `product_orders` where `payment_status` = 'success'
select `id`, `name`, `email`, `total_amount`, `payment_gateway`, `payment_status`, `status`, `created_at` from `product_orders` order by `id` desc limit 10