core/plugins/PageBuilder/Addons/Tenants/ThemeTwo/Product/ProductTypeList.php

select `id`, `name`, `slug` from `categories` where `status_id` = 1 and `id` in ('13', '14', '15', '16', '17') and `categories`.`deleted_at` is null
select `product_id` from `product_categories` where `category_id` in ('13', '14', '15', '16', '17')
select * from `badges` where `badges`.`id` in (3) and `badges`.`deleted_at` is null
select `id`, `name`, `slug`, `price`, `sale_price`, `badge_id`, `image_id` from `products` where `status_id` = 1 and `id` in (200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 231) and `products`.`deleted_at` is null order by `id` desc limit 8
---
    public function frontend_render()
    {
        $categories_id = $this->setting_item('categories');
        $title = SanitizeInput::esc_html($this->setting_item('title') ?? '');
        $subtitle = SanitizeInput::esc_html($this->setting_item('subtitle') ?? '');
        $item_show = SanitizeInput::esc_html($this->setting_item('item_show') ?? '');
        $view_all_url = SanitizeInput::esc_html($this->setting_item('view_all_url') ?? '');
        $padding_top = SanitizeInput::esc_html($this->setting_item('padding_top'));
        $padding_bottom = SanitizeInput::esc_html($this->setting_item('padding_bottom'));

        $categories = Category::where('status_id',1);
        $products = Product::with('badge')->where('status_id', 1);

        if (!empty($categories_id))
        {
            $categories = $categories->whereIn('id', $categories_id)->select('id', 'name', 'slug')->get();
            $products_id = ProductCategory::whereIn('category_id', $categories_id)->pluck('product_id')->toArray();
            $products->whereIn('id', $products_id);
        }

        if(!empty($item_show)){
            $products = $products->orderBy('id','desc')->select('id', 'name', 'slug', 'price', 'sale_price', 'badge_id', 'image_id')->take($item_show)->get();