core/app/Http/Controllers/Landlord/Frontend/LandlordFrontendController.php

    public function homepage()
    {
        $id = get_static_option('home_page');
        $page_post = Page::where('id', $id)->first();
---
select * from `pages` where `id` = '1' limit 1

    public function dynamic_single_page($slug)
    {
        $page_post = Page::where('slug', $slug)->firstOrFail();
---
select * from `pages` where `slug` = 'favicon.ico' limit 1