core/app/Http/Controllers/Landlord/Frontend/PaymentLogController.php

    public function order_payment_form(Request $request)
    {
        $manual_transection_condition = $request->selected_payment_gateway == 'manual_payment' ? 'required' : 'nullable';
        $request_pack_id = $request->package_id;
        $plan = PricePlan::findOrFail($request_pack_id);
---
select * from `price_plans` where `price_plans`.`id` = '4' limit 1

        }

        if ($request->custom_subdomain != null) {
            $has_subdomain = Tenant::find(trim($request->custom_subdomain));
---
select * from `tenants` where `tenants`.`id` = 'siam' limit 1

        }


        $order_details = PricePlan::find($request->package_id) ?? '';
---
select * from `price_plans` where `price_plans`.`id` = '4' limit 1

        $auth = auth()->guard('web')->user();
        $auth_id = $auth->id;

        $is_tenant = Tenant::find($subdomain);
---
select * from `tenants` where `tenants`.`id` = 'siam' limit 1

            }
        } // New Tenant + Plan (New Payment)
        else {
            $old_tenant_log = PaymentLogs::where(['user_id' => $auth_id, 'tenant_id' => trim($request->custom_subdomain)])->latest()->first();
            if (empty($old_tenant_log)) {
                $payment_log_id = PaymentLogs::create([
                    'email' => $email,
                    'name' => $name,
                    'package_name' => $order_details->title,
                    'package_price' => $amount_to_charge,
                    'package_gateway' => $selected_payment_gateway,
                    'package_id' => $package_id,
                    'user_id' => auth()->guard('web')->user()->id ?? null,
                    'tenant_id' => $subdomain ?? null,
                    'status' => 'pending',
                    'payment_status' => 'pending',
                    'is_renew' => 0,
                    'track' => Str::random(10),
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                    'start_date' => $package_start_date,
                    'expire_date' => $package_expire_date,
                ])->id;

                $payment_details = PaymentLogs::findOrFail($payment_log_id);
---
select * from `payment_logs` where (`user_id` = 10 and `tenant_id` = 'siam') order by `created_at` desc limit 1
insert into `payment_logs` (`email`, `name`, `package_name`, `package_price`, `package_gateway`, `package_id`, `user_id`, `tenant_id`, `status`, `payment_status`, `is_renew`, `track`, `start_date`, `expire_date`, `updated_at`, `created_at`) values ('misujon01@gmail.com', 'Mazharul Islam Suzon', 'Ultimate Plan', 599, 'paytm', '4', 10, 'siam', 'pending', 'pending', 0, 'r9JUZu5eIG', '09-01-2023 07:44:40', '2023-02-09 07:44:40', '2023-01-09 19:44:41', '2023-01-09 19:44:41')
select * from `payment_logs` where `payment_logs`.`id` = 127 limit 1