core/app/Http/Controllers/Landlord/Frontend/UserDashboardController.php

select count(*) as aggregate from `payment_logs` where `user_id` = 10
select count(*) as aggregate from `support_tickets` where `user_id` = 10
select * from `payment_logs` where `user_id` = 10 order by `id` desc limit 4
---
    public function user_index()
    {
        $package_orders = PaymentLogs::where('user_id', $this->logged_user_details()->id)->count();
        $support_tickets = SupportTicket::where('user_id', $this->logged_user_details()->id)->count();
        $recent_logs = PaymentLogs::where('user_id', $this->logged_user_details()->id)->orderBy('id', 'desc')->take(4)->get();

select * from `users` where `users`.`id` = 10 limit 1
---
    public function logged_user_details()
    {
        $old_details = '';
        if (empty($old_details)) {
            $old_details = User::findOrFail(Auth::guard('web')->user()->id);