core/Modules/Product/Http/Middleware/ProductLimitMiddleware.php

select count(*) as aggregate from `products`
---
    public function handle(Request $request, Closure $next)
    {
        (string) $getRouteName = Route::currentRouteName();
        $routeArray = explode('.', $getRouteName);

        $product_count = Product::withTrashed()->count();