core/plugins/PageBuilder/Addons/Landlord/Common/Feedback.php

select * from `testimonials` where `status` = 1 order by `id` asc limit 3
---
    public function frontend_render()
    {
        $current_lang = GlobalLanguage::user_lang_slug();
        $title = SanitizeInput::esc_html($this->setting_item('title_'.$current_lang)) ?? '';
        $subtitle = SanitizeInput::esc_html($this->setting_item('subtitle_'.$current_lang)) ?? '';
        $item_show = SanitizeInput::esc_html($this->setting_item('item_show') ?? '');
        $order_by = SanitizeInput::esc_html($this->setting_item('order_by'));
        $order = SanitizeInput::esc_html($this->setting_item('order'));
        $padding_top = SanitizeInput::esc_html($this->setting_item('padding_top'));
        $padding_bottom = SanitizeInput::esc_html($this->setting_item('padding_bottom'));

        $testimonial = Testimonial::where('status',1);
        $testimonial = $testimonial->orderBy($order_by,$order);

        if(!empty($item_show)){
            $testimonial = $testimonial->take($item_show)->get();