core/plugins/PageBuilder/Addons/Landlord/Common/PricePlan.php

    public function frontend_render()
    {
        $current_lang = GlobalLanguage::user_lang_slug();
        $title = SanitizeInput::esc_html($this->setting_item('title_'.$current_lang)) ?? '';
        $subtitle = SanitizeInput::esc_html($this->setting_item('subtitle_'.$current_lang)) ?? '';
        $padding_top = SanitizeInput::esc_html($this->setting_item('padding_top'));
        $padding_bottom = SanitizeInput::esc_html($this->setting_item('padding_bottom'));

        $order_by = SanitizeInput::esc_html($this->setting_item('order_by'));
        $order = SanitizeInput::esc_html($this->setting_item('order'));

        $all_price_plan = \App\Models\PricePlan::with('plan_features')->where('status',1)->orderBy($order_by ?? 'id',$order ?? 'asc')->get()->groupBy('type');
---
select * from `plan_features` where `plan_features`.`plan_id` in (1, 2, 3, 4, 7)
select * from `price_plans` where `status` = 1 order by `id` asc