core/plugins/PageBuilder/Addons/Landlord/Common/Themes.php

select * from `themes` where `status` = 1 order by `id` asc
---
    public function frontend_render()
    {
        $current_lang = GlobalLanguage::user_lang_slug();
        $padding_top = SanitizeInput::esc_html($this->setting_item('padding_top'));
        $padding_bottom = SanitizeInput::esc_html($this->setting_item('padding_bottom'));

        $title = SanitizeInput::esc_html($this->setting_item('title_'.$current_lang)) ?? '';
        $subtitle = SanitizeInput::esc_html($this->setting_item('subtitle_'.$current_lang)) ?? '';
        $theme_url = SanitizeInput::esc_url($this->setting_item('theme_page_url')) ?? '';

        $bg_shape_image = $this->setting_item('background_shape') ?? '';

        $themes = \App\Models\Themes::where('status', 1)->orderBy('id', 'asc')->get();