core/Modules/CountryManage/Http/Controllers/Tenant/Admin/CountryManageController.php

    public function index()
    {
        $all_countries = Country::all();
---
select * from `countries`