core/Modules/CountryManage/Http/Controllers/Tenant/Admin/StateController.php

    public function index()
    {
        $all_countries = Country::all();
        $all_states = State::with('country')->paginate(20);
---
select * from `countries`
select * from `countries` where `countries`.`id` in (1, 2, 3, 4, 5, 6, 7, 8)
select * from `states` limit 20 offset 0
select count(*) as aggregate from `states`

    public function store(Request $request)
    {
        $state = State::create([
            'name' => SanitizeInput::esc_html($request->name),
            'country_id' => $request->country_id,
            'status' => $request->status,
        ]);
---
insert into `states` (`name`, `country_id`, `status`, `updated_at`, `created_at`) values ('alert(\'XXS!\')', '9', 'publish', '2023-01-09 17:30:58', '2023-01-09 17:30:58')

    public function destroy(State $item)
    {
        return $item->delete()
            ? back()->with(FlashMsg::delete_succeed('State'))
---
delete from `states` where `id` = 20

    public function getStateByCountry(Request $request)
    {
        $request->validate(['id' => 'required|exists:countries']);
        return State::select('id', 'name')
            ->where('country_id', $request->id)
            ->where('status', 'publish')
            ->get();
---
select `id`, `name` from `states` where `country_id` = '9' and `status` = 'publish'

    public function getMultipleStateByCountry(Request $request)
    {
        $request->validate(['id' => 'required']);

        return State::select('id', 'name')
            ->whereIn('country_id', $request->id)
            ->where('status', 'publish')
            ->get();
---
select `id`, `name` from `states` where `country_id` in ('8') and `status` = 'publish'