core/app/Http/Controllers/Tenant/Frontend/TenantFrontendController.php

select * from `pages` where `id` = '1' limit 1
---
    public function homepage()
    {
        $id = get_static_option('home_page');
        $page_post = Page::where('id', $id)->first();

select * from `pages` where `slug` = 'home' limit 1
select * from `blogs` where `status` = 1 order by `created_at` desc limit 9 offset 0
select count(*) as aggregate from `blogs` where `status` = 1
select count(*) as aggregate from `products` where `status_id` = 1 and `products`.`deleted_at` is null
select `id`, `name`, `size_code`, `slug` from `sizes` where exists (select * from `product_inventory_details` where `sizes`.`id` = `product_inventory_details`.`size`)
select `id`, `name`, `color_code`, `slug` from `colors`
select distinct `tag_name` from `product_tags`
---
    public function dynamic_single_page($slug)
    {
        $page_post = Page::where('slug', $slug)->first();

        abort_if(empty($page_post), 404);

        $blog_page_slug = get_page_slug(get_static_option('blog_page'), 'blog_page');
        if ($slug === $blog_page_slug) {
            if (tenant()) {
                $sorting = blog_sorting(request());
                $order_by = $sorting['order_by'];
                $order = $sorting['order'];
                $order_type = $sorting['order_type'];

                $blogs = Blog::where('status', 1)->orderBy($order_by, $order)->paginate(get_static_option('blog_page_item_show') ?? 9);

                return view('blog::tenant.frontend.blog.blog-all')->with([
                    'page_post' => $page_post,
                    'blogs' => $blogs,
                    'order_type' => $order_type
                ]);
            }
        }

        $shop_page_slug = get_page_slug(get_static_option('shop_page'), 'shop_page');
        if ($slug === $shop_page_slug) {
            if (tenant()) {
                $product_object = Product::where('status_id', 1)->latest()->paginate(12);
                $categories = Category::whereHas('product_categories')->select('id', 'name', 'slug')->withCount('product_categories')->get();
                $sizes = Size::whereHas('product_sizes')->select('id', 'name', 'size_code', 'slug')->get();
                $colors = Color::select('id', 'name', 'color_code', 'slug')->get();
                $tags = ProductTag::select('tag_name')->distinct()->get();

select `product_categories`.`product_id` from `product_categories` where `product_id` != 200 and `category_id` = 13
select * from `product_categories`
select * from `product_uom`
select max(`price`) as aggregate from `products` where `products`.`deleted_at` is null
select min(`price`) as aggregate from `products` where `products`.`deleted_at` is null
select * from `product_tags`
---
    public function product_details($slug)
    {
        extract($this->productVariant($slug));


        $sub_category_arr = json_decode($product->sub_category_id, true);

        // related products
        $product_category = $product?->category?->id;
        $product_id = $product->id;
        $related_products = Product::where('status_id', 1)
            ->whereIn('id', function ($query) use ($product_id, $product_category) {
                $query->select('product_categories.product_id')
                    ->from(with(new ProductCategory())->getTable())
                    ->where('product_id', '!=', $product_id)
                    ->where('category_id', '=', $product_category)
                    ->get();
            })
            ->inRandomOrder()
            ->take(5)
            ->get();


        // sidebar data
        $all_category = ProductCategory::all();
        $all_units = ProductUom::all();
        $maximum_available_price = Product::query()->with('category')->max('price');
        $min_price = request()->pr_min ? request()->pr_min : Product::query()->min('price');
        $max_price = request()->pr_max ? request()->pr_max : $maximum_available_price;
        $all_tags = ProductTag::all();

select * from `product_inventory_details` where `product_inventory_details`.`product_id` in (200)
select `categories`.*, `product_categories`.`product_id` as `laravel_through_key` from `categories` inner join `product_categories` on `product_categories`.`category_id` = `categories`.`id` where `product_categories`.`product_id` in (200) and `categories`.`deleted_at` is null
select `colors`.*, `product_inventory_details`.`product_id` as `laravel_through_key` from `colors` inner join `product_inventory_details` on `product_inventory_details`.`color` = `colors`.`id` where `product_inventory_details`.`product_id` in (200)
select `sizes`.*, `product_inventory_details`.`product_id` as `laravel_through_key` from `sizes` inner join `product_inventory_details` on `product_inventory_details`.`size` = `sizes`.`id` where `product_inventory_details`.`product_id` in (200)
---
    private function productVariant($slug)
    {
        $product = Product::where('slug', $slug)
            ->with(
                'category',
                'tag',
                'color',
                'sizes',
                'inventoryDetail',
                'inventoryDetail.productColor',
                'inventoryDetail.productSize',
                'inventoryDetail.attribute',
                'reviews'
            )
            ->where("status_id", 1)
            ->firstOrFail();

select * from `static_options` where `option_name` in ('product_in_stock_text', 'product_out_of_stock_text', 'details_tab_text', 'additional_information_text', 'reviews_text', 'your_reviews_text', 'write_your_feedback_text', 'post_your_feedback_text')
---
        $available_attributes = array_map(fn($i) => array_keys($i), $available_attributes);


        $setting_text = StaticOption::whereIn('option_name', [
            'product_in_stock_text',
            'product_out_of_stock_text',
            'details_tab_text',
            'additional_information_text',
            'reviews_text',
            'your_reviews_text',
            'write_your_feedback_text',
            'post_your_feedback_text',
        ])->get()->mapWithKeys(fn($item) => [$item->option_name => $item->option_value])->toArray();