core/Modules/Blog/Http/Controllers/Tenant/Frontend/BlogController.php

    public function blog_single($slug)
    {
        $blog_post = Blog::with(['user', 'category', 'comments'])->where(['slug' => $slug, 'status' => 1])->firstOrFail();
        $blog_comments = BlogComment::where(['blog_id' => $blog_post->id, 'parent_id' => null])->orderByDesc('created_at')->take(3)->get();
        $blog_comments_count = BlogComment::where(['blog_id' => $blog_post->id, 'parent_id' => null])->count();

        $all_category = BlogCategory::withCount('blogs')->has('blogs')->get();
        $all_tags = BlogTag::orderByDesc('created_at')->select('id','title','slug')->take(15)->get();
---
select * from `blog_categories` where `blog_categories`.`id` in (10)
select * from `blog_comments` where `blog_comments`.`blog_id` in (7)
select * from `blogs` where (`slug` = 'script-alert-xxs-script' and `status` = 1) limit 1
select * from `blog_comments` where (`blog_id` = 7 and `parent_id` is null) order by `created_at` desc limit 3
select count(*) as aggregate from `blog_comments` where (`blog_id` = 7 and `parent_id` is null)
select `id`, `title`, `slug` from `blog_tags` order by `created_at` desc limit 15