core/plugins/PageBuilder/PageBuilderBase.php

    public function get_settings()
    {
        $widget_data = !empty($this->args['id']) ? PageBuilder::find($this->args['id']) : [];
---
select * from `page_builders` where `page_builders`.`id` = 19 limit 1