core/database/seeders/Tenant/AdminSeed.php

    public function run()
    {

        $raw_pass = '12345678';

            $admin = Admin::create([
                'name' => 'Super Admin',
                'username' => 'super_admin',
                'email' => 'super@admin.com',
                'password' => Hash::make($raw_pass),
            ]);
---
insert into `admins` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) values ('Super Admin', 'super_admin', 'super@admin.com', '$2y$10$KEHDjOdyT57YGj0gNTwBN.S9uca2nnkUCba1FBjK78t0TR/FiC69y', '2023-01-10 12:54:46', '2023-01-10 12:54:46')