core/database/seeders/Tenant/BlogSeed.php

    private function blog_store($title, $description, $category_id, $image_id)
    {
        $admin = Admin::first();
---
select * from `admins` limit 1

        ];

        $blog->save();
        $blog->metainfo()->create($Metas);
---
insert into `meta_infos` (`title`, `description`, `image`, `tw_image`, `tw_title`, `tw_description`, `fb_image`, `fb_title`, `fb_description`, `metainfoable_id`, `metainfoable_type`, `updated_at`, `created_at`) values ('blog', 'blog', '', '', 'blog', 'blog', '', 'blog', 'blog', 1, 'Modules\Blog\Entities\Blog', '2023-01-10 12:54:47', '2023-01-10 12:54:47')