core/database/seeders/Tenant/LanguageSeed.php

    public function run()
    {
        Language::create([
            'name' => __('English (USA)'),
            'direction' => 0,
            'slug' => 'en_US',
            'status' => 1,
            'default' => 1
        ]);

        Language::create([
            'name' => __('Arabic'),
            'direction' => 1,
            'slug' => 'ar',
            'status' => 1,
            'default' => 0
        ]);
---
insert into `languages` (`name`, `direction`, `slug`, `status`, `default`, `updated_at`, `created_at`) values ('English (USA)', 0, 'en_US', 1, 1, '2023-01-10 12:54:46', '2023-01-10 12:54:46')
insert into `languages` (`name`, `direction`, `slug`, `status`, `default`, `updated_at`, `created_at`) values ('Arabic', 1, 'ar', 1, 0, '2023-01-10 12:54:46', '2023-01-10 12:54:46')