core/database/seeders/Tenant/PageSeed.php

insert into `pages` (`slug`, `title`, `page_content`, `visibility`, `status`, `navbar_variant`, `footer_variant`, `page_builder`, `breadcrumb`, `updated_at`, `created_at`) values ('home', 'Home', 'Home', 0, 1, '01', '01', 1, 0, '2023-01-10 12:54:46', '2023-01-10 12:54:46')
---
    public function run()
    {
        $page_data = new Page();
        $page_data->slug = Str::slug('home');
        $page_data->title = __('Home');
        $page_data->page_content = __('Home');
        $page_data->visibility = 0;
        $page_data->status = 1;
        $page_data->navbar_variant = '01';
        $page_data->footer_variant = '01';
        $page_data->page_builder = 1;
        $page_data->breadcrumb = 0;

        $Metas = [
            'title' => SanitizeInput::esc_html(''),
            'description' => SanitizeInput::esc_html('Demo meta desc'),
            'image' => null,
            //twitter
            'tw_image' => null,
            'tw_title' => SanitizeInput::esc_html('tw title'),
            'tw_description' => SanitizeInput::esc_html('tw desc'),
            //facebook
            'fb_image' => null,
            'fb_title' =>  SanitizeInput::esc_html('fb title'),
            'fb_description' =>  SanitizeInput::esc_html('fb desc'),
        ];

        $page_data->save();

insert into `pages` (`slug`, `title`, `page_content`, `visibility`, `status`, `navbar_variant`, `footer_variant`, `page_builder`, `breadcrumb`, `updated_at`, `created_at`) values ('about', 'About Us', 'About us content', 0, 1, '01', '01', 1, 1, '2023-01-10 12:54:46', '2023-01-10 12:54:46')
insert into `meta_infos` (`title`, `description`, `image`, `tw_image`, `tw_title`, `tw_description`, `fb_image`, `fb_title`, `fb_description`, `metainfoable_id`, `metainfoable_type`, `updated_at`, `created_at`) values ('Demo Meta Title', 'Demo meta desc', '', '', 'tw title', 'tw desc', '', 'fb title', 'fb desc', 2, 'App\Models\Page', '2023-01-10 12:54:46', '2023-01-10 12:54:46')
---
            'fb_description' =>  SanitizeInput::esc_html('fb desc'),
        ];

        $page_data_2->save();
        $page_data_2->metainfo()->create($Metas_2);

insert into `pages` (`slug`, `title`, `page_content`, `visibility`, `status`, `navbar_variant`, `footer_variant`, `page_builder`, `breadcrumb`, `updated_at`, `created_at`) values ('contact', 'Contact', 'contact content', 0, 1, '01', '01', 1, 1, '2023-01-10 12:54:46', '2023-01-10 12:54:46')
insert into `meta_infos` (`title`, `description`, `image`, `tw_image`, `tw_title`, `tw_description`, `fb_image`, `fb_title`, `fb_description`, `metainfoable_id`, `metainfoable_type`, `updated_at`, `created_at`) values ('Demo Meta Title', 'Demo meta desc', '', '', 'tw title', 'tw desc', '', 'fb title', 'fb desc', 3, 'App\Models\Page', '2023-01-10 12:54:46', '2023-01-10 12:54:46')
---
            'fb_description' =>  SanitizeInput::esc_html('fb desc'),
        ];

        $page_data_5->save();
        $page_data_5->metainfo()->create($Metas_5);

insert into `pages` (`slug`, `title`, `page_content`, `visibility`, `status`, `navbar_variant`, `footer_variant`, `page_builder`, `breadcrumb`, `updated_at`, `created_at`) values ('shop', 'Shop', 'contact content', 0, 1, '01', '01', 0, 1, '2023-01-10 12:54:46', '2023-01-10 12:54:46')
insert into `meta_infos` (`title`, `description`, `image`, `tw_image`, `tw_title`, `tw_description`, `fb_image`, `fb_title`, `fb_description`, `metainfoable_id`, `metainfoable_type`, `updated_at`, `created_at`) values ('Demo Meta Title', 'Demo meta desc', '', '', 'tw title', 'tw desc', '', 'fb title', 'fb desc', 4, 'App\Models\Page', '2023-01-10 12:54:46', '2023-01-10 12:54:46')
---
            'fb_description' =>  SanitizeInput::esc_html('fb desc'),
        ];

        $page_data_6->save();
        $page_data_6->metainfo()->create($Metas_6);

insert into `pages` (`slug`, `title`, `page_content`, `visibility`, `status`, `navbar_variant`, `footer_variant`, `page_builder`, `breadcrumb`, `updated_at`, `created_at`) values ('blog', 'Blog', 'Blog content', 0, 1, '01', '01', 0, 1, '2023-01-10 12:54:46', '2023-01-10 12:54:46')
insert into `meta_infos` (`title`, `description`, `image`, `tw_image`, `tw_title`, `tw_description`, `fb_image`, `fb_title`, `fb_description`, `metainfoable_id`, `metainfoable_type`, `updated_at`, `created_at`) values ('Demo Meta Title', 'Demo meta desc', '', '', 'tw title', 'tw desc', '', 'fb title', 'fb desc', 5, 'App\Models\Page', '2023-01-10 12:54:46', '2023-01-10 12:54:46')
---
            'fb_description' =>  SanitizeInput::esc_html('fb desc'),
        ];

        $page_data_7->save();
        $page_data_7->metainfo()->create($Metas_7);

select * from `pages` where `pages`.`id` = 1 limit 1
delete from `page_builders` where `addon_page_id` = 1
---
    private function upload_layout($file, $page_id)
    {
        DB::beginTransaction();
        try {
            $file_contents = json_decode(file_get_contents('assets/tenant/seeder_files/page-layouts/'.$file));

            $contentArr = [];
            if (current($file_contents)->addon_page_type == 'dynamic_page')
            {
                foreach ($file_contents as $key => $content)
                {
                    unset($content->id);
                    $content->addon_page_id = (int)trim($page_id);
                    $content->created_at = now();
                    $content->updated_at = now();

                    foreach ($content as $key2 => $con)
                    {
                        $contentArr[$key][$key2] = $con;
                    }
                }

                Page::findOrFail($page_id)->update(['page_builder' => 1]);

                PageBuilder::where('addon_page_id', $page_id)->delete();