core/database/seeders/Tenant/RolePermissionSeed.php

        ];

        foreach ($permissions as $permission){
            \Spatie\Permission\Models\Permission::updateOrCreate(['name' => $permission,'guard_name' => 'admin']);
---
insert into `permissions` (`guard_name`, `name`, `updated_at`, `created_at`) values ('admin', 'page-list', '2023-01-10 12:54:43', '2023-01-10 12:54:43')
select * from `permissions` where (`name` = 'page-list' and `guard_name` = 'admin') limit 1