core/database/seeders/Tenant/StatusSeed.php

    public function run()
    {
        $status = [
            [
                'id' => 1,
                'name' => 'active'
            ],
            [
                'id' => 2,
                'name' => 'inactive'
            ]
        ];

        Status::insert($status);
---
insert into `statuses` (`id`, `name`) values (1, 'active'), (2, 'inactive')