core/app/Helpers/funtions.php

function get_static_option($option_name, $default = null)
{
    $value = Cache::remember($option_name, 60 * 60, function () use ($option_name) {
        try {
            return StaticOption::where('option_name', $option_name)->first();
---
select * from `static_options` where `option_name` = 'default_theme' limit 1

function get_static_option_central($option_name, $default = null)
{
    $value = Cache::remember($option_name, 30, function () use ($option_name) {
        try {
            return \App\Models\StaticOptionCentral::where('option_name', $option_name)->first();
---
select * from `static_option_centrals` where `option_name` = 'get_script_version' limit 1

function get_attachment_image_by_id($id, $size = null, $default = false): array
{
    $image_details = Cache::remember('media_image_' . $id, 60 * 60 * 24, function () use ($id) {
        return \App\Models\MediaUploader::find($id);
---
select * from `media_uploaders` where `media_uploaders`.`id` is null limit 1

function update_static_option($key, $value): bool
{
    $static_option = null;
    if ($static_option === null) {
        try {
            $static_option = StaticOption::query();
        } catch (\Exception $e) {
        }
    }
    try {
        $static_option->updateOrCreate(['option_name' => $key], [
            'option_name' => $key,
            'option_value' => $value
        ]);
---
insert into `static_options` (`option_name`, `option_value`, `updated_at`, `created_at`) values ('placeholder_image', '', '2023-01-09 19:38:50', '2023-01-09 19:38:50')
select * from `static_options` where (`option_name` = 'site_title') limit 1

function update_static_option_central($key, $value): bool
{
    $static_option = null;
    if ($static_option === null) {
        try {
            $static_option = \App\Models\StaticOptionCentral::query();
        } catch (\Exception $e) {
        }
    }
    try {
        $static_option->updateOrCreate(['option_name' => $key], [
            'option_name' => $key,
            'option_value' => $value
        ]);
---
select * from `static_option_centrals` where (`option_name` = 'get_script_version') limit 1

function get_default_language()
{
    $defaultLang = \App\Models\Language::where('default', 1)->first();
---
select * from `languages` where `default` = 1 limit 1

function get_page_slug($id, $default = null)
{
    return \App\Models\Page::where('id', $id)->first()->slug ?? $default;
---
select * from `pages` where `id` = '5' limit 1

function get_page_info($id, $default = null)
{
    return \App\Models\Page::where('id', $id)->select('id','slug','title')->first() ?? $default;
---
select `id`, `slug`, `title` from `pages` where `id` = 1 limit 1

function render_frontend_sidebar($location, $args = [])
{
    $output = '';
    $all_widgets = \App\Models\Widgets::where(['widget_location' => $location])->orderBy('widget_order', 'ASC')->get();
---
select * from `widgets` where (`widget_location` = 'footer') order by `widget_order` asc

function render_admin_saved_widgets($location)
{
    $output = '';
    $all_widgets = \App\Models\Widgets::where(['widget_location' => $location])->orderBy('widget_order', 'asc')->get();
---
select * from `widgets` where (`widget_location` = 'footer') order by `widget_order` asc

function get_user_lang_direction()
{
    $default = \App\Models\Language::where('default', 1)->first();
    $user_direction = \App\Models\Language::where('slug', session()->get('lang'))->first();
---
select * from `languages` where `default` = 1 limit 1
select * from `languages` where `slug` is null limit 1