core/plugins/PageBuilder/Addons/Tenants/ThemeOne/Product/FlashStore.php

select `id`, `title` from `campaigns` where `status` = 'publish'
---
    public function admin_render()
    {
        $output = $this->admin_form_before();
        $output .= $this->admin_form_start();
        $output .= $this->default_fields();
        $widget_saved_values = $this->get_settings();

        $output .= Text::get([
            'name' => 'title',
            'label' => __('Section Title'),
            'value' => $widget_saved_values['title'] ?? null,
        ]);

        $campaign = Campaign::where('status', 'publish')->select('id','title')->get()->mapWithKeys(function ($item){
            return [$item->id => $item->title];
        })->toArray();

select * from `campaigns` where `campaigns`.`id` = '14' limit 1
---
    public function frontend_render()
    {
        $campaign_id = $this->setting_item('champaign');
        $title = SanitizeInput::esc_html($this->setting_item('title') ?? '');
        $item_show = SanitizeInput::esc_html($this->setting_item('item_show') ?? '');
        $padding_top = SanitizeInput::esc_html($this->setting_item('padding_top'));
        $padding_bottom = SanitizeInput::esc_html($this->setting_item('padding_bottom'));

        $campaign = Campaign::find($campaign_id);