core/plugins/PageBuilder/Addons/Tenants/ThemeOne/Product/ProductTypeList.php

    public function admin_render()
    {
        $output = $this->admin_form_before();
        $output .= $this->admin_form_start();
        $output .= $this->default_fields();
        $widget_saved_values = $this->get_settings();

        $output .= Text::get([
            'name' => 'title',
            'label' => __('Section Title'),
            'value' => $widget_saved_values['title'] ?? null,
        ]);

        $categories = Category::where(['status_id' => 1])->get()->mapWithKeys(function ($item){
            return [$item->id => $item->name];
        })->toArray();
---
select * from `categories` where (`status_id` = 1) and `categories`.`deleted_at` is null

    public function frontend_render()
    {
        $categories_id = $this->setting_item('categories');
        $title = SanitizeInput::esc_html($this->setting_item('title') ?? '');
        $item_show = SanitizeInput::esc_html($this->setting_item('item_show') ?? '');
        $view_all_url = SanitizeInput::esc_html($this->setting_item('view_all_url') ?? '');
        $padding_top = SanitizeInput::esc_html($this->setting_item('padding_top'));
        $padding_bottom = SanitizeInput::esc_html($this->setting_item('padding_bottom'));

        $categories = Category::where('status_id',1);
        $products = Product::with('badge')->where('status_id', 1);

        if (!empty($categories_id))
        {
            $categories = $categories->whereIn('id', $categories_id)->select('id', 'name', 'slug')->get();
            $products_id = ProductCategory::whereIn('category_id', $categories_id)->pluck('product_id')->toArray();
            $products->whereIn('id', $products_id);
        }

        if(!empty($item_show)){
            $products = $products->orderBy('id','desc')->select('id', 'name', 'slug', 'price', 'sale_price', 'badge_id', 'image_id')->take($item_show)->get();
---
select `id`, `name`, `slug` from `categories` where `status_id` = 1 and `id` in ('6', '8', '10', '11') and `categories`.`deleted_at` is null
select `product_id` from `product_categories` where `category_id` in ('6', '8', '10', '11')
select * from `badges` where `badges`.`id` in ('', 2, 3) and `badges`.`deleted_at` is null
select `id`, `name`, `slug`, `price`, `sale_price`, `badge_id`, `image_id` from `products` where `status_id` = 1 and `id` in (190, 191, 192, 193, 195, 196, 197) and `products`.`deleted_at` is null order by `id` desc limit 6