core/Modules/Product/Http/Controllers/CategoryController.php

    public function getSubCategory(Request $req)
    {
        // fetch sub category from category
        $categories = SubCategory::where("category_id" , $req->category_id)->get();
---
select * from `sub_categories` where `category_id` = '13' and `sub_categories`.`deleted_at` is null