core/Modules/Product/Http/Controllers/ProductController.php

    public function index(Request $request): Renderable
    {
        $products = AdminProductServices::productSearch($request);
        $statuses = Status::all();
---
select * from `statuses` where `statuses`.`deleted_at` is null

    public function create()
    {
        $data = [
            "brands" => Brand::select("id", "name")->get(),
            "badges" => Badge::where("status","active")->get(),
            "units" => Unit::select("id", "name")->get(),
            "tags" => Tag::select("id", "tag_text as name")->get(),
            "categories" => Category::select("id", "name")->get(),
            "deliveryOptions" => DeliveryOption::select("id", "title", "sub_title", "icon")->get(),
            "all_attribute" => ProductAttribute::all()->groupBy('title')->map(fn($query) => $query[0]),
            "product_colors" => Color::all(),
            "product_sizes" => Size::all(),
        ];
---
select `id`, `name` from `brands` where `brands`.`deleted_at` is null
select * from `badges` where `status` = 'active' and `badges`.`deleted_at` is null
select `id`, `name` from `units`
select `id`, `tag_text` as `name` from `tags`
select `id`, `name` from `categories` where `categories`.`deleted_at` is null
select `id`, `title`, `sub_title`, `icon` from `delivery_options` where `delivery_options`.`deleted_at` is null
select * from `product_attributes`
select * from `colors`
select * from `sizes`

    public function edit($id, $aria_name = null)
    {
        $data = [
            "brands" => Brand::select("id", "name")->get(),
            "badges" => Badge::where("status","active")->get(),
            "units" => Unit::select("id", "name")->get(),
            "tags" => Tag::select("id", "tag_text as name")->get(),
            "categories" => Category::select("id", "name")->get(),
            "deliveryOptions" => DeliveryOption::select("id", "title", "sub_title", "icon")->get(),
            "all_attribute" => ProductAttribute::all()->groupBy('title')->map(fn($query) => $query[0]),
            "product_colors" => Color::all(),
            "product_sizes" => Size::all(),
            'aria_name' => $aria_name
        ];

        $product = (new AdminProductServices)->get_edit_product($id);
        $subCat = $product?->subCategory?->id ?? null;
        $cat = $product?->category?->id ?? null;

        $sub_categories = SubCategory::select("id", "name")->where("category_id", $cat)->where("status_id", 1)->get();
        $child_categories = ChildCategory::select("id", "name")->where("sub_category_id", $subCat)->where("status_id", 1)->get();
---
select `id`, `name` from `brands` where `brands`.`deleted_at` is null
select * from `badges` where `status` = 'active' and `badges`.`deleted_at` is null
select `id`, `name` from `units`
select `id`, `tag_text` as `name` from `tags`
select `id`, `name` from `categories` where `categories`.`deleted_at` is null
select `id`, `title`, `sub_title`, `icon` from `delivery_options` where `delivery_options`.`deleted_at` is null
select * from `product_attributes`
select * from `colors`
select * from `sizes`
select `id`, `name` from `sub_categories` where `category_id` = 13 and `status_id` = 1 and `sub_categories`.`deleted_at` is null
select `id`, `name` from `child_categories` where `sub_category_id` = 19 and `status_id` = 1 and `child_categories`.`deleted_at` is null